; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	spectrograph2 - mode
	thermograph0 - mode
	image1 - mode
	GroundStation0 - direction
	Star1 - direction
	Star3 - direction
	Star4 - direction
	GroundStation2 - direction
	Planet5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 image1)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon14)
)
(:goal (and
	(pointing satellite0 Planet12)
	(have_image Planet5 thermograph0)
	(have_image Star6 thermograph0)
	(have_image Phenomenon7 image1)
	(have_image Star8 image1)
	(have_image Planet9 thermograph0)
	(have_image Phenomenon10 image1)
	(have_image Phenomenon11 image1)
	(have_image Planet12 spectrograph2)
	(have_image Planet13 thermograph0)
	(have_image Phenomenon14 image1)
	(have_image Phenomenon15 image1)
))

)

; plan
1. (turn_to satellite0 groundstation2 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 12
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 12
3. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 0 of 12
4. (turn_to satellite0 phenomenon7 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon7)
   goals met: 0 of 12
5. (take_image satellite0 phenomenon7 instrument0 image1)
   added: (have_image phenomenon7 image1)
   goals met: 1 of 12
6. (turn_to satellite0 phenomenon15 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon15)
   goals met: 1 of 12
7. (take_image satellite0 phenomenon15 instrument0 image1)
   added: (have_image phenomenon15 image1)
   goals met: 2 of 12
8. (turn_to satellite0 phenomenon14 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon14)
   goals met: 2 of 12
9. (take_image satellite0 phenomenon14 instrument0 image1)
   added: (have_image phenomenon14 image1)
   goals met: 3 of 12
10. (turn_to satellite0 phenomenon11 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 12
11. (take_image satellite0 phenomenon11 instrument0 image1)
   added: (have_image phenomenon11 image1)
   goals met: 4 of 12
12. (turn_to satellite0 phenomenon10 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon10)
   goals met: 4 of 12
13. (take_image satellite0 phenomenon10 instrument0 image1)
   added: (have_image phenomenon10 image1)
   goals met: 5 of 12
14. (turn_to satellite0 planet13 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet13)
   goals met: 5 of 12
15. (take_image satellite0 planet13 instrument0 thermograph0)
   added: (have_image planet13 thermograph0)
   goals met: 6 of 12
16. (turn_to satellite0 planet5 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet5)
   goals met: 6 of 12
17. (take_image satellite0 planet5 instrument0 thermograph0)
   added: (have_image planet5 thermograph0)
   goals met: 7 of 12
18. (turn_to satellite0 planet9 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet9)
   goals met: 7 of 12
19. (take_image satellite0 planet9 instrument0 thermograph0)
   added: (have_image planet9 thermograph0)
   goals met: 8 of 12
20. (turn_to satellite0 star6 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star6)
   goals met: 8 of 12
21. (take_image satellite0 star6 instrument0 thermograph0)
   added: (have_image star6 thermograph0)
   goals met: 9 of 12
22. (turn_to satellite0 star8 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star8)
   goals met: 9 of 12
23. (take_image satellite0 star8 instrument0 image1)
   added: (have_image star8 image1)
   goals met: 10 of 12
24. (turn_to satellite0 planet12 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 planet12)
   goals met: 11 of 12
25. (take_image satellite0 planet12 instrument0 spectrograph2)
   added: (have_image planet12 spectrograph2)
   goals met: 12 of 12
